AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами/Ext/RecordSetModule.bsl
//уменьшение суммы взаиморасчетов - увеличение дебиторской задолженности
Функция ВыполнитьРасход(Знач Документ, Знач Организация, Знач Контрагент, Знач Договор, Знач Сумма) Экспорт
	
	Результат = Истина;
	
	Попытка
		НаборЗаписей = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Документ);
		НаборЗаписей.Прочитать();
		
		Расход = НаборЗаписей.Добавить();
		Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
		Расход.Период = Документ.Дата;
		Расход.Контрагент = Контрагент;
		Расход.Договор = Договор;
		//Расход.Документ = Документ;
		Расход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Документ, Сумма);
		Расход.Организация = Организация;
		
		НаборЗаписей.Записать();
	Исключение
		Результат = Ложь;
		Сообщить("Ошибка записи взаиморасчетов! " + ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
	
	Возврат Результат;

	
КонецФункции

//увеличение суммы взаиморасчетов - увеличение кредиторской задолженности
Функция ВыполнитьПриход(Знач Документ, Знач Организация, Знач Контрагент, Знач Договор, Знач Сумма) Экспорт
	
	Результат = Истина;
	
	Попытка
		НаборЗаписей = РегистрыНакопления.ВзаиморасчетыСКонтрагентами.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Документ);
		НаборЗаписей.Прочитать();
		
		Приход = НаборЗаписей.Добавить();
		Приход.ВидДвижения = ВидДвиженияНакопления.Приход;
		Приход.Период = Документ.Дата;
		Приход.Контрагент = Контрагент;
		Приход.Договор = Договор;
		//Приход.Документ = Документ;
		Приход.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Документ, Сумма);
		Приход.Организация = Организация;
		
		НаборЗаписей.Записать();
	Исключение
		Результат = Ложь;
		Сообщить("Ошибка записи взаиморасчетов! " + ОписаниеОшибки(),СтатусСообщения.Важное);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПриЗаписи(Отказ, Замещение)
	
	//#13710 убрано в формы документо-регистраторов
	////#9989
	//Если НЕ Отказ И ПолучитьФункциональнуюОпцию("ОтправлятьДетализациюВзаиморасчетовПриИзмененииВзаиморасчетов") Тогда
	//	Для каждого Запись из ЭтотОбъект Цикл
	//		
	//		МенеджерЗаписи = РегистрыСведений.ЗаданияНаОтправкуЭлектронныхПисем.СоздатьМенеджерЗаписи();
	//		МенеджерЗаписи.Документ 	= Запись.Регистратор;
	//		МенеджерЗаписи.ВидЗадания 	= Перечисления.ВидыЗаданийНаОтправкуЭлектронныхПисем.ОтправкаДетализацииВзаиморасчетов;
	//		МенеджерЗаписи.Прочитать();
	//		Если НЕ МенеджерЗаписи.Выбран() Тогда
	//			МенеджерЗаписи.Документ 	= Запись.Регистратор;
	//			МенеджерЗаписи.ВидЗадания 	= Перечисления.ВидыЗаданийНаОтправкуЭлектронныхПисем.ОтправкаДетализацииВзаиморасчетов;
	//			МенеджерЗаписи.Организация 	= Запись.Организация;
	//			МенеджерЗаписи.Контрагент 	= Запись.Контрагент;
	//			МенеджерЗаписи.Записать();
	//		КонецЕсли;
	//		
	//	КонецЦикла;
	//КонецЕсли;
	
КонецПроцедуры
